app/Controllers/Publics.php

function main($page)
{
    $model1 = new ModelMenus();
    $model2 = new ModelModuls();
    $model3 = new ModelPosts();
    $data['page'] = $page;
    $data['menus'] = $model1->findAll();
    $data['apps'] = $model2->findAll();
    $data['info'] = $model3->where('post_type', 'info')->where('post_status', 'publish')->findAll();
    $data['news'] = $model3->where('post_type', 'post')->where('post_status', 'publish')->findAll();
    $data['slider'] = $model3->where('post_type', 'slider')->findAll();
---
SELECT *
FROM `menus`
SELECT *
FROM `posts`
WHERE `post_type` = 'slider'

    public function detailberita($id)
    {
        if ((int)$id) {
            $data = main('Berita');
            $model = new ModelPosts();
            $modelUser = new ModelUsers();

            $new = ($model->where('id', $id)->findAll())[0];
            $author = $modelUser->where('id', $new['post_author'])->findAll();
---
SELECT *
FROM `posts`
WHERE `id` = '31'
SELECT *
FROM `users`
WHERE `id` = '2'